START_MESSAGE = 'Привет! Я чат-бот, задай вопрос текстом и я постараюсь ответить. '

HELP_MESSAGE = '''
                \nКоманды:\
                \n/reload - обнуляет историю сообщений;\
                \n/cancel - отменяет обработку запроса;\
                \n/help - вызывает список доступных команд.\
                '''

ERROR_TEXT = 'Что-то пошло не так, повторите попытку позже. Если проблема носит регулярный характер - воспользуйтесь командой */reload* для сброса истории общения с ботом.'

AWAIT = 'Подождите, Ваш запрос обрабатывается...'

WRONG_FORMAT = 'Отправьте, пожалуйста, текстовое сообщение, чтобы я мог предоставить ответ.'

CLEAR_HISTORY = 'История сообщений успешно очищена.'

CANCELED_REQUESTS = 'Все запросы к серверу отменены.'

PROHIBITED = 'У вас недостаточно прав.'

GENERATING_REPORT = 'В настоящее время отчет генерируется.'

NO_DATA = 'Сообщений, удовлетворяющих запросу, не нашлось.'

CANT_ANSWER = 'затрудняюсь с ответом'